import mock from '../mock';

const faqDB = [
	{
		id: '1',
		question: 'چطور میتوانم سفارشم را پیگیری کنم ؟',
		answer:
			`دیجی کالا برای افزایش سرعت پاسخ گویی به مشتریان با دریافت کد سفارش یا همان کد "DKC  " این امکان رو ایجاد کرده که بتونید در زمان کمتری به نتیجه مورد نظر خود برسید...

			`
	},
	{
		id: '2',
		question: 'چرا به شماره سفارش (DKC) نیاز داریم؟',
		answer: `شما میتوانید با مراجعه به پروفایل خود سفارش یا مرسوله ایی که از ارسال آن منصرف شدید را لغو نمایید. میتوانید برای مشاهده روند لغو سفارش به توضیحات تکمیلی مراجعه کنید.

		`
	},
	{
		id: '3',
		question: 'چطور میتوانم سفارشم را لغو کنم ؟',
		answer:
			`بله، دیجی کالا تسهیلاتی را فراهم کرده، شما میتوانید تا سقف 20 میلیون تومان به صورت اقساط  با بازپرداخت  6 ، 9 و 12 ماهه از سایت دیجی کالا خرید کنید.

			`
	},
	{
		id: '4',
		question: 'میتوانم سفارشم را بصورت اقساطی ( اعتباری ) پرداخت کنم؟',
		answer:
			`اعضای دیجی‌پلاس می‌توانند به ازای هر ماه اشتراک، چهار ارسال رایگان بر روی مرسوله های عادی که مبلغ آن‌ها کمتر از 500 هزار تومان است، داشته باشند.

			`
	},
	{
		id: '5',
		question: 'هزینه روش‌های ارسال با اشتراک دیجی‌پلاس چقدر است؟',
		answer:
			'Esse nisi mollit aliquip mollit aute consequat adipisicing. Do excepteur dolore proident cupidatat pariatur irure consequat incididunt.'
	},
	{
		id: '6',
		question: 'چطور درخواست خود را جهت بازگرداندن کالا (مرجوعی کالا) به شما اطلاع دهم؟',
		answer: `شما میتوانید از طریق فرم درخواست مرجوعی در حساب کاربری ، صفحه تماس با ما و تلفن درخواست خود را ثبت نمایید.

		`
	},
	{
		id: '7',
		question: 'شرایط خرید و بازگرداندن کالا برای کالاهای سوپر مارکتی چگونه است؟',
		answer:
			`لطفاً پیش از خرید، موارد زیر را به‌دقت بخوانید؛ زیرا ثبت هر سفارش در دیجی‌کالا به معنی موافقت با شرایط زیر است.

			`
	},
	{
		id: '8',
		question: 'شرایط گارانتی دیجی کالا',
		answer:
			`امروزه توجه به کیفیت کالا از مهمترین وظایف فروشندگان کالا است و خدمات پس از فروش ضامن حفظ این کیفیت می باشد.
			در همین راستا شرکت دیجی کالا  مفتخر به ارائه سرویس در اسرع وقت به مشتریان گرامی می باشد.`
	},
	{
		id: '9',
		question: 'چطور میتوانم بدون برقراری تماس، درخواست مرجوعی کالای خریداری شده را اعلام کنم؟',
		answer:
			`شما میتواند وارد پروفایل خود شوید و از قسمت درخواست مرجوعی ، فرم درخواست را تکمیل کنید.

			`
	},
	{
		id: '10',
		question: 'شرایط استفاده از کد تخفیف اولین خرید چیست؟',
		answer: `سیستم هوشمند دیجی کالا، پس از بررسی حساب کاربری در صورتی که مالک آن مشتری جدید دیجی کالا باشد...

		`
	},
	{
		id: '11',
		question: 'چطور میتوانم امتیاز‌ بگیریم؟',
		answer: `شما از سه راه می‌توانید امتیاز بگیرید:

		خرید کالا
		
		ثبت نظر
		
		انجام ماموریت‌های دیجی‌کلابی`
	},
	{
		id: '12',
		question: 'هزینه ی ارسال در دیجی کالا چگونه محاسبه میشود؟',
		answer:
			'هزینه ارسال بر اساس شیوه ارسال متفاوت است و در زمان ثبت سفارش نمایش داده می شود.'
	},
	{
		id: '13',
		question: 'چگونه می توانم نصب و پیگیری درگاه پرداخت هوشمند دیجی پی را انجام دهم؟',
		answer: 'شما میتوانید پس از مراجعه به لینک  https://www.mydigipay.com/ipg/ ، مراحل آن را مطالعه و فرم های لازم را تکمیل کرده و درصورت وجود سوالات فنی درخصوص راه اندازی درگاه با ایمیل merchant.support@mydigipay.com مکاتبه کنید'
	}
];

mock.onGet('/api/faq').reply(config => {
	return [200, faqDB];
});
